Autodesk.Revit.DB.Architecture.RiserToTreadConnectionOption
Represents the connection style of the riser and tread in relation to each other.
Since:
2013

Autodesk.Revit.DB.Architecture.RiserToTreadConnectionOption.JoinAll
The connection will join all risers and treads.

Autodesk.Revit.DB.Architecture.RiserToTreadConnectionOption.TreadUnderRiser
The connection will extend tread under riser.

Autodesk.Revit.DB.Architecture.RiserToTreadConnectionOption.RiserBehindTread
The connection will extend riser behind tread.